<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/5_Frame_Clause.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Frame Clause

## Overview

### ü•Ö Analysis Goals

Analyze cohort revenue and lifetime value (LTV) to uncover daily trends, short-term fluctuations, future potential, and long-term customer value patterns.

- **Daily Revenue Trends:** Calculate daily net revenue for each cohort to track individual day performance without cumulative or rolling effects.  
- **Short-Term Revenue Patterns:** Compute rolling 7-day revenue sums to smooth daily fluctuations and reveal weekly purchasing behaviors.  
- **Projected Short-Term Revenue:** Summarize net revenue for the next 3 days by cohort to identify patterns and assist in short-term forecasting.  
- **Cohort Revenue Insights:**  
  - Track cumulative revenue up to each date to measure cohort growth over time.  
  - Assess remaining cumulative revenue from each order date to analyze future revenue potential.  
  - Evaluate average LTV for each cohort using cumulative revenue and user counts, while incorporating a 7-day rolling average for recent customer activity.

### üìò Concepts Covered

- `CURRENT ROW`
- `N PRECEDING`¬†
- `N FOLLOWING`¬†
- `UNBOUNDED`
    - `UNBOUNDED PRECEDING`
    - `UNBOUNDED FOLLOWING`¬†

---

In [21]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the ipython-sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://postgres:***@localhost:5432/contoso_100k'

---

## CURRENT ROW

### üìù¬†Notes

`CURRENT ROW`

- **CURRENT ROW**: Refers to the current row in a window frame during a query execution.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Used to specify the row being processed as the start or end of a frame. Often combined with aggregations to apply calculations specific to the current row.
    ```

### üíª¬†Final Result

- Calculates the exact net revenue for each cohort on a daily basis without rolling or cumulative sums.
    - Helps isolate daily performance trends for each cohort without being influenced by revenue on other days.

#### Daily Revenue by Cohort

**`CURRENT ROW`**

1. Get the `cohort_year` and the total revenue for each user.  
   - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer.  
   - Group by `customerkey` to ensure the revenue and cohort year are calculated per user.  
   - Calculate the total revenue for each customer using `SUM(quantity * netprice * exchangerate)`.  
   - Select `cohort_year`, `customerkey`, and the total revenue (`total_customer_net_revenue`) to display the results.

In [22]:
%%sql

SELECT 
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
    customerkey,
    SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
FROM sales
GROUP BY 
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  total_customer_net_revenue
0            2018      2044589                     2470.73
1            2021      1603477                      136.62
2            2017       876049                     2601.13
3            2024      1469222                     5278.54
4            2018      2089398                       98.39
...           ...          ...                         ...
49482        2019       853617                      903.31
49483        2016      1573639                     6973.42
49484        2022      1355936                      149.99
49485        2024       967453                        5.40
49486        2022        34354                      828.80

[49487 rows x 3 columns]

2. Create a CTE to calculate the cohort year for each customer and return all results in the main query.  
   - Define a CTE `cohort_analysis` to extract the cohort year for each customer.  
      - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer.  
      - Group by `customerkey` to ensure the revenue and cohort year are calculated per user.  
      - Calculate the total revenue for each customer using `SUM(quantity * netprice * exchangerate)`.  
   - In the main query, use `SELECT * FROM cohort_analysis` to return all the results from the CTE.

In [ ]:
%%sql
-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey,
        SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
    FROM sales
    GROUP BY 
        customerkey
)

-- Added
SELECT *
FROM cohort_analysis

3. Use `CURRENT ROW` to gget the daily revenue.

In [24]:
%%sql 

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
)

-- Update 
SELECT
    cohort_year,
    orderdate,
    SUM(total_net_revenue) OVER ( -- Added 
        PARTITION BY cohort_year 
        ORDER BY orderdate 
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) AS daily_revenue
FROM cohort_analysis;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  daily_revenue
0           2015  2015-01-01       11640.80
1           2015  2015-01-02        5890.40
2           2015  2015-01-03       19796.67
3           2015  2015-01-05       12406.27
4           2015  2015-01-06       10349.87
...          ...         ...            ...
3289        2024  2024-04-16       25098.99
3290        2024  2024-04-17       32938.67
3291        2024  2024-04-18       28408.76
3292        2024  2024-04-19       48386.88
3293        2024  2024-04-20       96879.43

[3294 rows x 3 columns]

---

## N PRECEDING

`N PRECEDING`

- **N PRECEDING**: Refers to `N` rows before the current row in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN N PRECEDING AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Enables calculations involving the current row and up to `N` preceding rows, such as moving averages or cumulative sums for a fixed number of rows.


### üíª¬†Final Result

- Computes the rolling 7-day sum of net revenue for each cohort, smoothing fluctuations in daily revenue.
    - Identifies short-term trends in revenue, such as weekly purchasing patterns.

#### 7-Day Rolling Revenue by Cohort

**`PRECEEDING`**

1. Go into specific step / what we‚Äôre going to do. E.g. Use the `=` operator to set a new column to be equal to Experience

In [26]:
%%sql 

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
)

-- Update 
SELECT
    cohort_year,
    orderdate,
    SUM(total_net_revenue) OVER (
        ORDER BY orderdate 
        ROWS BETWEEN 6 PRECEDING AND CURRENT ROW
    ) AS rolling_7_day_revenue
FROM cohort_analysis;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  rolling_7_day_revenue
0           2015  2015-01-01               11640.80
1           2015  2015-01-02               17531.20
2           2015  2015-01-03               37327.87
3           2015  2015-01-05               49734.14
4           2015  2015-01-06               60084.01
...          ...         ...                    ...
3289        2024  2024-04-16              172116.63
3290        2024  2024-04-17              178945.14
3291        2024  2024-04-18              165990.04
3292        2024  2024-04-19              192500.12
3293        2024  2024-04-20              245226.68

[3294 rows x 3 columns]

---
## N FOLLOWING

### üìù¬†Notes

`N FOLLOWING`

- **N FOLLOWING**: Refers to `N` rows after the current row in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND N FOLLOWING
    ) AS window_column_alias
  FROM table_name;
  ```
- Useful for calculating aggregations involving the current row and a specified number of subsequent rows, such as projecting future totals or averages.

### üíª¬†Final Result

- Summarizes the next 3 days of net revenue for each cohort and date, projecting short-term revenue performance.
  - Useful for forecasting and identifying patterns in purchasing activity after a given date.

#### Future 3-Day Revenue by Cohort

**`FOLLOWING`**

1. Go into specific step / what we‚Äôre going to do. E.g. Use the `=` operator to set a new column to be equal to Experience

In [27]:
%%sql 

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
)

-- Update 
SELECT
    cohort_year,
    orderdate,
    SUM(total_net_revenue) OVER (
        ORDER BY orderdate 
        ROWS BETWEEN CURRENT ROW AND 3 FOLLOWING
    ) AS rolling_7_day_revenue
FROM cohort_analysis;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  rolling_7_day_revenue
0           2015  2015-01-01               49734.14
1           2015  2015-01-02               48443.21
2           2015  2015-01-03               53081.87
3           2015  2015-01-05               44589.47
4           2015  2015-01-06               41430.09
...          ...         ...                    ...
3289        2024  2024-04-16              134833.30
3290        2024  2024-04-17              206613.74
3291        2024  2024-04-18              173675.07
3292        2024  2024-04-19              145266.31
3293        2024  2024-04-20               96879.43

[3294 rows x 3 columns]

---
## UNBOUNDED

### üìù¬†Notes

`UNBOUNDED PRECEDING`

- **UNBOUNDED PRECEDING**: Refers to the first row of the partition or dataset in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Commonly used for cumulative calculations starting from the beginning of a partition, such as running totals or cumulative averages.

`UNBOUNDED FOLLOWING`

- **UNBOUNDED FOLLOWING**: Refers to the last row of the partition or dataset in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING
    ) AS window_column_alias
  FROM table_name;
  ```
- Often used to aggregate values from the current row to the end of the partition, such as totals or counts of future data.


### üíª¬†Final Result

  - Calculates the total accumulated revenue up to each date for every cohort.
    - Tracks long-term cohort growth and overall revenue contributions over time.
  - Measures remaining cumulative revenue from each order date to the end of the cohort‚Äôs activity.
    - Assists in understanding future revenue potential from a given point in time.
  - Calculates the average lifetime value (LTV) for each cohort based on cumulative revenue and user count.
    - Computes a 7-day rolling average LTV for shorter timeframes to analyze recent changes in customer value.
    - Provides insights into overall customer value trends and short-term customer activity for cohorts.

#### Cumulative Revenue from First Order

**`UNBOUNDED  PRECEDING`**

1. Use `UNBOUNDED PRECEDING` to get the cumulative net revenue starting from the first row.

In [28]:
%%sql 

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
)

-- Update 
SELECT
    cohort_year,
    orderdate,
    SUM(total_net_revenue) OVER ( -- Update
        ORDER BY orderdate 
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW -- Changed 
    ) AS cumulative_revenue
FROM cohort_analysis;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  cumulative_revenue
0           2015  2015-01-01            11640.80
1           2015  2015-01-02            17531.20
2           2015  2015-01-03            37327.87
3           2015  2015-01-05            49734.14
4           2015  2015-01-06            60084.01
...          ...         ...                 ...
3289        2024  2024-04-16        206200924.84
3290        2024  2024-04-17        206233863.51
3291        2024  2024-04-18        206262272.27
3292        2024  2024-04-19        206310659.15
3293        2024  2024-04-20        206407538.58

[3294 rows x 3 columns]

#### Remaining Revenue After Each Order

**`UNBOUNDED FOLLOWING`**

1. Use `UNBOUNDED FOLLOWING` to get the total revenue from the current date to the end.

In [29]:
%%sql 

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
)

-- Update 
SELECT
    cohort_year,
    orderdate,
    SUM(total_net_revenue) OVER (
        ORDER BY orderdate 
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING -- Changed 
    ) AS cumulative_revenue
FROM cohort_analysis;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  cumulative_revenue
0           2015  2015-01-01        206407538.58
1           2015  2015-01-02        206395897.78
2           2015  2015-01-03        206390007.38
3           2015  2015-01-05        206370210.71
4           2015  2015-01-06        206357804.44
...          ...         ...                 ...
3289        2024  2024-04-16           231712.73
3290        2024  2024-04-17           206613.74
3291        2024  2024-04-18           173675.07
3292        2024  2024-04-19           145266.31
3293        2024  2024-04-20            96879.43

[3294 rows x 3 columns]

#### Average and 7-Day Rolling LTV

**`FUNCTION` / Concept Covered**

1. Put the previous main query into a CTE called `rollowing_ltv` and in the main query select everything.

In [ ]:
%%sql 

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
)

-- Update 
SELECT
    cohort_year,
    orderdate,
    SUM(total_net_revenue) OVER (
        ORDER BY orderdate 
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING -- Changed 
    ) AS cumulative_revenue
FROM cohort_analysis;

2. Update the `SUM` to get the cumulative LTV.

In [18]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
),

rolling_ltv AS (
    SELECT
        cohort_year,
        orderdate,
        SUM(total_net_revenue) OVER (-- Updated
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW -- Changed 
        ) AS cumulative_revenue 
    FROM cohort_analysis
)

SELECT *
FROM rolling_ltv

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  cumulative_revenue
0           2015  2015-01-01            11640.80
1           2015  2015-01-02            17531.20
2           2015  2015-01-03            37327.87
3           2015  2015-01-05            49734.14
4           2015  2015-01-06            60084.01
...          ...         ...                 ...
3289        2024  2024-04-16          8189913.64
3290        2024  2024-04-17          8222852.31
3291        2024  2024-04-18          8251261.07
3292        2024  2024-04-19          8299647.95
3293        2024  2024-04-20          8396527.38

[3294 rows x 3 columns]

In [33]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
),

rolling_ltv AS (
    SELECT
        cohort_year,
        orderdate,
        SUM(total_net_revenue) OVER (
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS cumulative_revenue,
        COUNT(*) OVER ( -- Added 
            PARTITION BY cohort_year 
            ORDER BY orderdate ROWS 
            BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS user_count
    FROM cohort_analysis
)

SELECT
    cohort_year,
    orderdate,
    cumulative_revenue,
    user_count
FROM rolling_ltv;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  cumulative_revenue  user_count
0           2015  2015-01-01            11640.80           1
1           2015  2015-01-02            17531.20           2
2           2015  2015-01-03            37327.87           3
3           2015  2015-01-05            49734.14           4
4           2015  2015-01-06            60084.01           5
...          ...         ...                 ...         ...
3289        2024  2024-04-16          8189913.64         105
3290        2024  2024-04-17          8222852.31         106
3291        2024  2024-04-18          8251261.07         107
3292        2024  2024-04-19          8299647.95         108
3293        2024  2024-04-20          8396527.38         109

[3294 rows x 4 columns]

4. Calulate the rolling average LTV using: `cumulative_revenue / user_count`.

In [34]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
),

rolling_ltv AS (
    SELECT
        cohort_year,
        orderdate,
        SUM(total_net_revenue) OVER (
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS cumulative_revenue,
        COUNT(*) OVER ( -- Added 
            PARTITION BY cohort_year 
            ORDER BY orderdate ROWS 
            BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS user_count
    FROM cohort_analysis
)

SELECT
    cohort_year,
    orderdate,
    cumulative_revenue,
    user_count,
    cumulative_revenue / user_count AS rolling_avg_ltv
FROM rolling_ltv;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

     cohort_year   orderdate  cumulative_revenue  user_count  rolling_avg_ltv
0           2015  2015-01-01            11640.80           1         11640.80
1           2015  2015-01-02            17531.20           2          8765.60
2           2015  2015-01-03            37327.87           3         12442.62
3           2015  2015-01-05            49734.14           4         12433.53
4           2015  2015-01-06            60084.01           5         12016.80
...          ...         ...                 ...         ...              ...
3289        2024  2024-04-16          8189913.64         105         77999.18
3290        2024  2024-04-17          8222852.31         106         77574.08
3291        2024  2024-04-18          8251261.07         107         77114.59
3292        2024  2024-04-19          8299647.95         108         76848.59
3293        2024  2024-04-20          8396527.38         109         77032.36

[3294 rows x 5 columns]

5. Add two new columns to get the rolling 7 day revenue and 7 day user count

In [43]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
),

rolling_ltv AS (
    SELECT
        cohort_year,
        orderdate,
        SUM(total_net_revenue) OVER (
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS cumulative_revenue,
        COUNT(*) OVER ( -- Added 
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS user_count,
        SUM(total_net_revenue) OVER ( -- Added 
            PARTITION BY cohort_year 
            ORDER BY orderdate
            ROWS BETWEEN 6 PRECEDING AND CURRENT ROW
        ) AS rolling_7_day_revenue,
        COUNT(*) OVER ( -- Added 
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN 6 PRECEDING AND CURRENT ROW
        ) AS rolling_7_day_user_count
    FROM cohort_analysis
)

SELECT
    cohort_year,
    orderdate,
    cumulative_revenue,
    user_count,
    cumulative_revenue / user_count AS rolling_avg_ltv,
    rolling_7_day_revenue,
    rolling_7_day_user_count
FROM rolling_ltv;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

,cohort_year,orderdate,cumulative_revenue,user_count,rolling_avg_ltv,rolling_7_day_revenue,rolling_7_day_user_count
0,2015,2015-01-01,11640.80,1,11640.80,11640.80,1
1,2015,2015-01-02,17531.20,2,8765.60,17531.20,2
2,2015,2015-01-03,37327.87,3,12442.62,37327.87,3
3,2015,2015-01-05,49734.14,4,12433.53,49734.14,4
4,2015,2015-01-06,60084.01,5,12016.80,60084.01,5
...,...,...,...,...,...,...,...
3289,2024,2024-04-16,8189913.64,105,77999.18,172116.63,7
3290,2024,2024-04-17,8222852.31,106,77574.08,178945.14,7
3291,2024,2024-04-18,8251261.07,107,77114.59,165990.04,7
3292,2024,2024-04-19,8299647.95,108,76848.59,192500.12,7
3293,2024,2024-04-20,8396527.38,109,77032.36,245226.68,7

6. Calulate the rolling 7 day average LTV using: `rolling_7_day_revenue / rolling_7_day_user_count`.

In [44]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        orderdate
),

rolling_ltv AS (
    SELECT
        cohort_year,
        orderdate,
        SUM(total_net_revenue) OVER (
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS cumulative_revenue,
        COUNT(*) OVER ( -- Added 
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
        ) AS user_count,
        SUM(total_net_revenue) OVER (
            PARTITION BY cohort_year 
            ORDER BY orderdate
            ROWS BETWEEN 6 PRECEDING AND CURRENT ROW
        ) AS rolling_7_day_revenue,
        COUNT(*) OVER ( -- Added 
            PARTITION BY cohort_year 
            ORDER BY orderdate 
            ROWS BETWEEN 6 PRECEDING AND CURRENT ROW
        ) AS rolling_7_day_user_count
    FROM cohort_analysis
)

SELECT
    cohort_year,
    orderdate,
    cumulative_revenue,
    user_count,
    cumulative_revenue / user_count AS rolling_avg_ltv,
    rolling_7_day_revenue / rolling_7_day_user_count AS rolling_7_avg_ltv
FROM rolling_ltv;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

,cohort_year,orderdate,cumulative_revenue,user_count,rolling_avg_ltv,rolling_7_avg_ltv
0,2015,2015-01-01,11640.80,1,11640.80,11640.80
1,2015,2015-01-02,17531.20,2,8765.60,8765.60
2,2015,2015-01-03,37327.87,3,12442.62,12442.62
3,2015,2015-01-05,49734.14,4,12433.53,12433.53
4,2015,2015-01-06,60084.01,5,12016.80,12016.80
...,...,...,...,...,...,...
3289,2024,2024-04-16,8189913.64,105,77999.18,24588.09
3290,2024,2024-04-17,8222852.31,106,77574.08,25563.59
3291,2024,2024-04-18,8251261.07,107,77114.59,23712.86
3292,2024,2024-04-19,8299647.95,108,76848.59,27500.02
3293,2024,2024-04-20,8396527.38,109,77032.36,35032.38